code-review/NRB_3471_3546/База_Было/Documents/ЦБВПути.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЦБВПути</Name>
			<BasedOn>
				<xr:Item>Document.Поручение</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиЦБ</xr:Item>
				<xr:Item>AccumulationRegister.ЦБВПути</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперацииД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Поручение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Комментарий100</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоХранения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоХраненияПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проверка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделСчетаДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделСчетаДепоМХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепоМХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделСчетаДепоМХПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепоМХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделСчетаДепоПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособХранения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДепоМХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепоМХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДепоМХПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепоМХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДепоПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦБ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>9</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выписка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Выписка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Enums/СтатусыСчетовДепо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыСчетовДепо</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Открыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеОткрыт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Enums/КлассыОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>КлассыОпераций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Административные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Инвентарные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Глобальные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Информационные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Комплексные</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Catalogs/СчетаДепо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>СчетаДепо</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидСчетаДепо</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСчетовДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВходящийНомерПоручения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Поручение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаключенияДепозитарногоДоговора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытияСчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОткрытияСчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДепозитарногоДоговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОперацияЗакрытияСчетаДепо</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗакрытиеСчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОперацияОткрытияСчета</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОткрытиеСчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойРазделСчетаДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПризнакСчетаДепо</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПризнакиСчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусСчетаДепо</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыСчетовДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетВМестеРасчетовКодКлиента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетВМестеРасчетовНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетВМестеРасчетовНаименованиеКлиента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетВМестеРасчетовНомерСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетВМестеРасчетовНомерСчетаКлиента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСчетаДепо</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСчетовДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БИКМестаРасчетов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>35</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодМестаРасчетов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>35</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БикОтправителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БикКлиентаОтправителяПолучателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСчетаДепоFCDR_2017_02</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыСчетовДепоFCDR_2017_02</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеТипаСчетаДепоFCDR_2017_02</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСчетаБенефициараFCDR_2017_02</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыСчетовДепоFCDR_2017_02</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДепоМХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепоМХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Catalogs/РазделыСчетаДепо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>РазделыСчетаДепо</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.СчетаДепо</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВходящийНомерПоручения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Поручение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытияСчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОткрытияСчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Залогодержатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийКодНРД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОперацияОткрытияСчета</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОткрытиеРазделаСчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделСчетаДепоМХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепоМХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусСчетаДепо</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыСчетовДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипРазделаСчетаДЕПО</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРазделовСчетовДЕПО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделСубклиента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субклиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Субклиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОперацияЗакрытияРаздела</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗакрытиеРазделаСчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписаниеПоПредписаниюБР</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Брокер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Documents/ЦБВПути/Ext/ObjectModule.bsl
// Количество ЦБ с обременением для списания
//
Перем КолСписЦБСОбрем;

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

// Процедура заполнения реквизитов в зависимости от вида операции
//
Процедура ЗаполнениеРеквизитовПоВидуОперации() Экспорт
	
	Если ВидОперацииД = Справочники.ВидыОпераций.Перевод Тогда
		
		МестоХраненияПолучатель 	= МестоХранения;
		СчетДепоМХПолучатель		= СчетДепоМХ;
		РазделСчетаДепоМХПолучатель	= РазделСчетаДепоМХ;
		
	ИначеЕсли ВидОперацииД = Справочники.ВидыОпераций.Перемещение
				ИЛИ ВидОперацииД = Справочники.ВидыОпераций.ПереводМеждуРазделамиСчетаДепо Тогда
		
		Получатель					= Инициатор;
		СчетДепоПолучатель			= СчетДепо;
		РазделСчетаДепоПолучатель 	= РазделСчетаДепо;
		
	КонецЕсли;

КонецПроцедуры // ЗаполнениеРеквизитовПоВидуОперации()
	
#Если Клиент Тогда
	
// Функция определения достаточности остатка на счете для списания 
//
Функция НеХватаетОстатка(выбРегистр, выбМомент, выбИзмерения, выбЗначение, КолСписываемыхСОбременением=0)
	
	Перем ЕстьОшибка;
	
	ЕстьОшибка = ЛОЖЬ;
	текОстаток = выбРегистр.Остатки(выбМомент, выбИзмерения,,"Количество");
	
	Если текОстаток.Количество() = 0 ИЛИ текОстаток.Итог("Количество") < выбЗначение Тогда
		
		ЕстьОшибка = ИСТИНА;
		Возврат ЕстьОшибка;
		
	КонецЕсли;
	
	Если выбРегистр = РегистрыНакопления.ОстаткиЦБ Тогда
		
		ОстатокСвободных 		= 0;
		ОстатокСОбременением 	= 0;
		
		Для каждого СтрокаОстаток Из текОстаток Цикл
			
			Если СтрокаОстаток.СтатусЦБ = Перечисления.СтатусыЦБ.Свободна Тогда
				
				ОстатокСвободных = СтрокаОстаток.Количество;
				
			КонецЕсли;
			
			Если СтрокаОстаток.СтатусЦБ = Перечисления.СтатусыЦБ.Обременена Тогда
				
				ОстатокСОбременением = СтрокаОстаток.Количество;
				
			КонецЕсли;
			
		КонецЦикла; 
	
		Если ОстатокСвободных + ОстатокСОбременением < выбЗначение Тогда
			
			ЕстьОшибка = ИСТИНА;
			Возврат ЕстьОшибка;
			
		КонецЕсли;
		
		Если ОстатокСвободных < выбЗначение Тогда
			
			Если Вопрос("Списывать ЦБ с обременением?", РежимДиалогаВопрос.ДаНет,,,) = КодВозвратаДиалога.Да Тогда
				
				КолСписываемыхСОбременением = выбЗначение - ОстатокСвободных;
				
			Иначе
				
				ЕстьОшибка =  Истина;
				
			КонецЕсли;
				
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ЕстьОшибка;
	
КонецФункции // НеХватаетОстатка()

// Функция определения наличия ошибок 
//
Функция ЕстьОшибки()
	
	Перем ЕстьОшибка;
	
	ЕстьОшибка = ЛОЖЬ;
	КолСписЦБСОбрем = 0;
	
	//ПРИЕМ ЦЕННЫХ БУМАГ НА ХРАНЕНИЕ И УЧЕТ
	Если ВидОперацииД = Справочники.ВидыОпераций.Депонирование Тогда
		
		Если СчетДепо.СтатусСчетаДепо = Перечисления.СтатусыСчетовДепо.Закрыт Тогда
			
			Сообщить("Счет депо получателя закрыт!");
			ЕстьОшибка = ИСТИНА;
			
		ИначеЕсли СчетДепо.СтатусСчетаДепо = Перечисления.СтатусыСчетовДепо.НеОткрыт Тогда
			
			Сообщить("Счет депо получателя не открыт!");
			ЕстьОшибка = ИСТИНА;
			
		КонецЕсли;
		
	//СНЯТИЕ ЦЕННЫХ БУМАГ С ХРАНЕНИЯ И УЧЕТА
	ИначеЕсли ВидОперацииД = Справочники.ВидыОпераций.СнятиеСДепонирования Тогда
	
		Если НеХватаетОстатка(РегистрыНакопления.ОстаткиЦБ, МоментВремени(), Новый Структура("СчетДепо,РазделСчетаДепо,СчетДепоМХ,РазделСчетаДепоМХ,ЦБ",СчетДепо,РазделСчетаДепо,СчетДепоМХ,РазделСчетаДепоМХ,ЦБ), Количество, КолСписЦБСОбрем) Тогда
				
			Сообщить("Количество списания превышает остаток на счете клиента!");
			ЕстьОшибка = ИСТИНА;
				
		КонецЕсли;	
		
	//ПЕРЕВОД ЦЕННЫХ БУМАГ
	ИначеЕсли ВидОперацииД = Справочники.ВидыОпераций.Перевод Тогда
	
		Если СчетДепоПолучатель.СтатусСчетаДепо = Перечисления.СтатусыСчетовДепо.Закрыт Тогда
			
			Сообщить("Счет депо получателя закрыт!");
			ЕстьОшибка = ИСТИНА;
			
		ИначеЕсли СчетДепоПолучатель.СтатусСчетаДепо = Перечисления.СтатусыСчетовДепо.НеОткрыт Тогда
			
			Сообщить("Счет депо получателя не открыт!");
			ЕстьОшибка = ИСТИНА;
			
		КонецЕсли;		
		
		Если НеХватаетОстатка(РегистрыНакопления.ОстаткиЦБ, МоментВремени(), Новый Структура("СчетДепо,РазделСчетаДепо,СчетДепоМХ,РазделСчетаДепоМХ,ЦБ",СчетДепо,РазделСчетаДепо,СчетДепоМХ,РазделСчетаДепоМХ,ЦБ), Количество, КолСписЦБСОбрем) Тогда
				
			Сообщить("Количество списания превышает остаток на счете клиента!");
			ЕстьОшибка = ИСТИНА;
				
		КонецЕсли;
		
	//ПЕРЕМЕЩЕНИЕ ЦЕННЫХ БУМАГ
	ИначеЕсли ВидОперацииД = Справочники.ВидыОпераций.Перемещение
				ИЛИ ВидОперацииД = Справочники.ВидыОпераций.ПереводМеждуРазделамиСчетаДепо Тогда
	
		Если НеХватаетОстатка(РегистрыНакопления.ОстаткиЦБ, МоментВремени(), Новый Структура("СчетДепо,РазделСчетаДепо,СчетДепоМХ,РазделСчетаДепоМХ,ЦБ",СчетДепо,РазделСчетаДепо,СчетДепоМХ,РазделСчетаДепоМХ,ЦБ), Количество, КолСписЦБСОбрем) Тогда
				
			Сообщить("Количество списания превышает остаток на счете клиента!");
			ЕстьОшибка = ИСТИНА;
				
		КонецЕсли;	
		
	Иначе
		
		Сообщить("Данная операция документом Операция с ЦБ не производится!");
		ЕстьОшибка = ИСТИНА;
		
	КонецЕсли;		
	
	Возврат ЕстьОшибка;
	
КонецФункции // ЕстьОшибки()

#Конецесли
//////////////////////////////////////////////////////////////////////////////////
//// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПроведения(Отказ, Режим)
	
    #Если Клиент Тогда
	Отказ = ЕстьОшибки();
	#Конецесли
	Если ВидОперацииД = Справочники.ВидыОпераций.Депонирование Тогда
			
		Движение = Движения.ЦБВПути.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.СчетДепо = СчетДепо;
		Движение.РазделСчетаДепо = РазделСчетаДепо;
		Движение.ЦБ = ЦБ;
		Движение.СчетДепоМХ = СчетДепоМХ;
		Движение.РазделСчетаДепоМХ = РазделСчетаДепоМХ;
		Движение.Количество = Количество;

	ИначеЕсли ВидОперацииД = Справочники.ВидыОпераций.СнятиеСДепонирования Тогда
			
		Движение = Движения.ЦБВПути.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.СчетДепо = СчетДепо;
		Движение.РазделСчетаДепо = РазделСчетаДепо;
		Движение.ЦБ = ЦБ;
		Движение.СчетДепоМХ = СчетДепоМХ;
		Движение.РазделСчетаДепоМХ = РазделСчетаДепоМХ;
		Движение.Количество = Количество;
			
		Если Количество > КолСписЦБСОбрем Тогда
				
			Движение = Движения.ОстаткиЦБ.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.СчетДепо = СчетДепо;
			Движение.РазделСчетаДепо = РазделСчетаДепо;
			Движение.ЦБ = ЦБ;
			Движение.СчетДепоМХ = СчетДепоМХ;
			Движение.РазделСчетаДепоМХ = РазделСчетаДепоМХ;
			Движение.СтатусЦБ = Перечисления.СтатусыЦБ.Свободна;
			Движение.Количество = Количество - КолСписЦБСОбрем;
				
		КонецЕсли;
			
		Если КолСписЦБСОбрем > 0 Тогда
				
			Движение = Движения.ОстаткиЦБ.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.СчетДепо = СчетДепо;
			Движение.РазделСчетаДепо = РазделСчетаДепо;
			Движение.ЦБ = ЦБ;
			Движение.СчетДепоМХ = СчетДепоМХ;
			Движение.РазделСчетаДепоМХ = РазделСчетаДепоМХ;
			Движение.СтатусЦБ = Перечисления.СтатусыЦБ.Обременена;
			Движение.Количество = КолСписЦБСОбрем;
				
		КонецЕсли;
		
	ИначеЕсли ВидОперацииД = Справочники.ВидыОпераций.Перевод
		ИЛИ ВидОперацииД = Справочники.ВидыОпераций.Перемещение
		ИЛИ ВидОперацииД = Справочники.ВидыОпераций.ПереводМеждуРазделамиСчетаДепо Тогда
			
		Если Количество > КолСписЦБСОбрем Тогда
				
			Движение = Движения.ОстаткиЦБ.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.СчетДепо = СчетДепо;
			Движение.РазделСчетаДепо = РазделСчетаДепо;
			Движение.ЦБ = ЦБ;
			Движение.СчетДепоМХ = СчетДепоМХ;
			Движение.РазделСчетаДепоМХ = РазделСчетаДепоМХ;
			Движение.СтатусЦБ = Перечисления.СтатусыЦБ.Свободна;
			Движение.Количество = Количество - КолСписЦБСОбрем;
				
		КонецЕсли;
			
		Если КолСписЦБСОбрем > 0 Тогда
				
			Движение = Движения.ОстаткиЦБ.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.СчетДепо = СчетДепо;
			Движение.РазделСчетаДепо = РазделСчетаДепо;
			Движение.ЦБ = ЦБ;
			Движение.СчетДепоМХ = СчетДепоМХ;
			Движение.РазделСчетаДепоМХ = РазделСчетаДепоМХ;
			Движение.СтатусЦБ = Перечисления.СтатусыЦБ.Обременена;
			Движение.Количество = КолСписЦБСОбрем;
				
		КонецЕсли;
			
		Движение = Движения.ЦБВПути.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.СчетДепо = СчетДепоПолучатель;
		Движение.РазделСчетаДепо = РазделСчетаДепоПолучатель;
		Движение.ЦБ = ЦБ;
		Движение.СчетДепоМХ = СчетДепоМХПолучатель;
		Движение.РазделСчетаДепоМХ = РазделСчетаДепоМХПолучатель;
		Движение.Количество = Количество;
			
	КонецЕсли;
		
	// записываем движения регистров
	Движения.ОстаткиЦБ.Записать();
	Движения.ЦБВПути.Записать();
	
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	// регистр ЦБВПути Приход

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры // ОбработкаПроведения()

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
    
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	#Если Клиент Тогда
	
	Если ВидОперацииД = Справочники.ВидыОпераций.ПустаяСсылка() Тогда
		
		Предупреждение("Не выбран вид операции");  
		Отказ = Истина;			
		
	КонецЕсли;	    
	
	//Если СпособХранения = Перечисления.СпособыХранения.ПустаяСсылка() Тогда
	//	
	//	Предупреждение("Не выбран способ хранения");  
	//	Отказ = Истина;			
	//	
	//КонецЕсли;
	
	Если СчетДепоМХ = Справочники.СчетаДепоМХ.ПустаяСсылка() Тогда
		
		Предупреждение("Не выбран счет депо хранилища");  
		Отказ = Истина;			
		
	КонецЕсли;
	
	Если СчетДепо = Справочники.СчетаДепо.ПустаяСсылка() Тогда
		
		Предупреждение("Не выбран счет депо депонента");  
		Отказ = Истина;			
		
	КонецЕсли;	     
	
	Если РазделСчетаДепоМХ = Справочники.РазделыСчетаДепоМХ.ПустаяСсылка() Тогда
		
		Предупреждение("Не выбран раздел счета депо хранилища");  
		Отказ = Истина;			
		
	КонецЕсли;	                                        
	
	Если РазделСчетаДепо = Справочники.РазделыСчетаДепо.ПустаяСсылка() Тогда
		
		Предупреждение("Не выбран раздел счета депо депонента");  
		Отказ = Истина;			
		
	КонецЕсли;
	
	Если Инициатор = Справочники.Контрагенты.ПустаяСсылка() Тогда
		
		Предупреждение("Не выбран депонент");  
		Отказ = Истина;			
		
	КонецЕсли;	
	
	Если МестоХранения = Справочники.МестаХранения.ПустаяСсылка() Тогда
		
		Предупреждение("Не выбрано хранилище");  
		Отказ = Истина;			
		
	КонецЕсли;	
	
	Если ЦБ = Справочники.ЦенныеБумаги.ПустаяСсылка() Тогда
		
		Предупреждение("Не выбрана ценная бумага");  
		Отказ = Истина;			
		
	КонецЕсли;	
	
	Если Количество = 0 Тогда
		
		Предупреждение("Не задано количество");  
		Отказ = Истина;			
		
	КонецЕсли;
	
	Если ВидОперацииД = Справочники.ВидыОпераций.Перевод
		ИЛИ ВидОперацииД = Справочники.ВидыОпераций.Перемещение
		ИЛИ ВидОперацииД = Справочники.ВидыОпераций.ПереводМеждуРазделамиСчетаДепо Тогда
		
		Если Получатель = Справочники.Контрагенты.ПустаяСсылка() Тогда
		
			Предупреждение("Не выбран депонент-получатель");  
			Отказ = Истина;			
		
		КонецЕсли;	
		
		Если СчетДепоПолучатель = Справочники.СчетаДепо.ПустаяСсылка() Тогда
		
			Предупреждение("Не выбран счет депо получателя");  
			Отказ = Истина;			
		
		КонецЕсли;	
		
		Если РазделСчетаДепоПолучатель = Справочники.РазделыСчетаДепо.ПустаяСсылка() Тогда
		
			Предупреждение("Не выбран раздел счета депо получателя");  
			Отказ = Истина;			
		
		КонецЕсли;	
		
		Если МестоХраненияПолучатель = Справочники.МестаХранения.ПустаяСсылка() Тогда
		
			Предупреждение("Не выбрано хранилище получателя");  
			Отказ = Истина;			
		
		КонецЕсли;	
		
		Если СчетДепоМХПолучатель = Справочники.СчетаДепоМХ.ПустаяСсылка() Тогда
		
			Предупреждение("Не выбран счет депо хранилища получателя");  
			Отказ = Истина;			
		
		КонецЕсли;	
		
		Если РазделСчетаДепоМХПолучатель = Справочники.РазделыСчетаДепоМХ.ПустаяСсылка() Тогда
		
			Предупреждение("Не выбран раздел счета депо хранилища получателя");  
			Отказ = Истина;			
		
		КонецЕсли;	
		
	КонецЕсли;
	
	#КонецЕсли

	УстановитьНовыйНомер();
КонецПроцедуры // ПередЗаписью()

Процедура ОбработкаЗаполнения(Основание) Экспорт
	
	Если ЗначениеЗаполнено(Основание) И Основание.ВидОперацииД.КлассОпераций = Перечисления.КлассыОпераций.Инвентарные Тогда 
			
		ДокументОснование 	= Основание.Ссылка;			
		ВидОперацииД	 	= Основание.ВидОперацииД;			
		Комментарий			= "Поручение № " + Основание.Номер + " от " + Основание.Дата;
		Инициатор			= Основание.Инициатор;
		СчетДепо			= Основание.СчетДепо;
		РазделСчетаДепо		= Основание.РазделСчетаДепо;
		МестоХранения		= Основание.МХДепонента;
		ЦБ					= Основание.ЦБ;
		Цена                = Основание.ЦенаСделкиЦБ;
		Сумма               = Основание.СуммаСделки;
		Дата				= ОбщегоНазначения.ДатаДокумента(Основание);
			
		ЗаполнениеРеквизитовПоВидуОперации();
					
	Иначе
			
		Проверка = Истина;
		ДокументОснование 	= Документы.Поручение.ПустаяСсылка();			
		Сообщить("На основании данного вида поручения нельзя создать документ ""Ценные бумаги в пути"". 
				  |Класс операции должен относиться к классу инвентарных операций!");
				  
		Возврат;	
			
	КонецЕсли;
	
КонецПроцедуры // ОбработкаЗаполнения

////////////////////////////////////////////////////////////////////////////////
//процедуры печати
#Если Клиент Тогда
// Возвращает доступные варианты печати документа
//
// Вовращаемое значение:
//  Струткура, каждая строка которой соответствует одному из вариантов печати
// 
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	СтруктураПечатныхФорм = Новый Структура;
	Возврат СтруктураПечатныхФорм;
КонецФункции // ПолучитьСтруктуруПечатныхФорм()

// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходмое количество копий.
//
//  Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь, НепосредственнаяПечать = Ложь) Экспорт
КонецПроцедуры

#КонецЕсли

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	СтандартнаяОбработка = Ложь;
	
	Префикс = НумераторыОбъектов.ПолучитьПрефиксНомера(ЭтотОбъект);
	
	Номер = НумераторыОбъектов.ПолучитьНомерДокумента(ЭтотОбъект, Префикс);
	
КонецПроцедуры
